# AsBoolean Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCData..::..AsBoolean Method
IFCData Class See Also
---
Gets storage value as boolean when its PrimitiveType is boolean.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool AsBoolean()
```

Visual Basic
---
```text
Public Function AsBoolean As Boolean
```

Visual C++
---
```text
public:
bool AsBoolean()
```

# ### Return Value
The bool value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | The primitive type is not boolean. |

# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace